{"basics":{"name":"Raina Cao","label":"","image":"/assets/img/IMG_1787.jpg","email":"rainacao01@gmail.com","phone":"","url":"https://rainacao.github.io/","summary":"vacuuming under the bed","location":{"address":"","postalCode":"","city":"","countryCode":"","region":""},"profiles":[{"network":"LinkedIn","username":"rainacao","url":"https://www.linkedin.com/in/rainacao/"}]},"work":[{"name":"Data and Analytic Services, BC Centre for Disease Control","position":"Data Scientist w/ Lisa Y.W. Tang","location":"Vancouver, BC, Canada","startDate":"2024-09-01","endDate":"2025-04-01","summary":"Developed data-driven systems to collect, analyze, and visualize misinformation patterns from social media for public health surveillance.","highlights":["Built an automated web-scraping pipeline (Python, Selenium) to collect location- and keyword-specific posts from Instagram and X on a daily basis, with caching, rate-limit handling, and text parsing.","Cleaned and processed 5,000+ social media posts, creating geospatial visualizations of misinformation patterns for public health surveillance.","Designed and evaluated misinformation classification systems using open-source LLMs and traditional ML models, benchmarking multiple preprocessing strategies.","Delivered findings to supervisors and policymakers through reports and presentations, supporting data-driven decision making."]},{"name":"Dynamic Brain Circuits in Health and Disease Cluster, Djavad Mowafaghian Centre for Brain Health, University of British Columbia","position":"Neuroscience Open Science Specialist w/ Jeffrey LeDue & Timothy H. Murphy","location":"Vancouver, BC, Canada","startDate":"2023-06-01","endDate":"2024-05-01","summary":"Supported neuroscience research by developing data infrastructure, automation tools, and reproducible workflows for multiple labs and institutional projects.","highlights":["Automated data ingestion by scraping 200+ neuroscience events with Python/BeautifulSoup to update a widely used research website.","Developed Python and Jupyter-based tools for image processing, vision tracking, and data parsing, supporting multiple neuroscience labs.","Created a collaboration visualization tool in Python/Jupyter that generated figures for organizational reviews and remains in active use.","Improved reproducibility infrastructure by migrating projects into Apptainer containers, documenting workflows, and training researchers on GitHub and OSF."]}],"education":[{"institution":"University of British Columbia","location":"Vancouver, Canada","url":"https://www.ubc.ca/","area":"Brain and Cognition","studyType":"Bachelor of Science, Cognitive Systems","startDate":"","endDate":"2025-11"}],"awards":[],"certificates":[],"publications":[],"skills":[],"languages":[{"language":"English","fluency":"Native speaker","icon":""},{"language":"Chinese (Mandarin)","fluency":"Fluent","icon":""}],"interests":[{"name":"Illustration","icon":"fa-solid fa-palette","keywords":[]},{"name":"Birding","icon":"fa-solid fa-bird","keywords":[]}],"references":[],"projects":[]}